import Accordion, { AccordionItemType } from './Accordion';

const Question: React.FC = () => {
  const faqData: AccordionItemType[] = [
    {
      question: 'چرا زودفیکس؟ چه مزیتی برای مصرف کننده دارد؟',
      answer: 'افزایش سرعت اجرا - تنوع در انواع ملات‌ها - جلوگیری از پرت مصالح - مقاومت کششی و فشاری بالاتر - دسترسی آسان و راحت در کار - قابلیت نگهداری طولانی مدت در انبار - مدیریت هزینه ها',
    },
    {
      question: 'آدرس شرکت زودفیکس کجاست؟',
      answer: 'آدرس:شهرک صنعتی بزرگ شیراز، حدفاصل میدان دوم و سوم خیابان سازندگی، انتهای خیابان 605، شرکت پایابتن (برند زودفیکس)',
    },
    {
      question: 'آدرس تان روی گوگل مپ کجاست؟',
      Link: 'https://maps.app.goo.gl/itvFkeVMYg2o44rs8',
    },
    {
      question: 'شماره تماس مدیر فروش چیست؟',
      answer: '09169799533',
    },
    {
      question: 'چه دسته بندی محصولاتی تولید میکنید؟',
      answer: ' ملات - چسب بلوک  - پودر بندکشی - پلاستر - گروت - عایق - و...',
    },
    {
      question: 'چند نوع ملات تولید میکنید؟',
      answer: 'ملات بنایی خاکستری - ملات بنای سفید - ملات بلوک و آجر - ملات تک لبه - ملات سنگ کاری - ملات کاهگل',
    },
    {
      question: 'چند نوع چسب بلوک تولید میکنید؟',
      answer: 'چسب بلوک ACCخاکستری تیپ ۱ - چسب بلوکACC خاکستری تیپ ۲ - چسب بلوکACC سفید - چسب کاشی و سرامیک خاکستری - چسب کاشی و سرامیک سفید - چسب کاشی و سرامیک خمیری - چسب سنگ',
    },
    {
      question: 'چند نوع پودر بندکشی تولید میکنید؟',
      answer: 'پودر بندکشی کاشی و سرامیک خاکستری - پودر بندکشی تعمیرات عمومی - پودر درزگیری فروشگاهی',
    },
    {
      question: 'چند نوع پلاستر تولید میکنید؟',
      answer: 'پلاستر خاکستری زبره داخلی - پلاستر خاکستری زبری بیرونی - پلاستر سفید نرمه داخلی - پلاستر سفید نرمه بیرونی - پلاستر پلیمری سفید نرمه قابل استفاده روی گچ - پلاستر آستر خاکستری - پلاستر آستر سفید - پلاستر گچ و خاک',
    },
    {
      question: 'چند نوع گروت تولید میکنید؟',
      answer: 'گروت صنعتی پایه ساختمانی - گروت تعمیری بتن',
    },
    {
      question: 'چند نوع عایق تولید میکنید؟',
      answer: 'عایق رطوبتی خاکستری - عایق رطوبتی سفید - عایق حرارتی - عایق صوت و حرارت',
    },
    {
      question: 'آیا محصول دیگری هم تولید میکنید؟',
      answer: 'بله، این چندمورد هم در شرکت زودفیکس تولید می شود. : سیمان سفید - سیمان خاکستری - خاک رس - پودر سنگ',
    },
  ];

  return (
    <div className="container mx-auto">
      <section className="bg-background xl:px-60 px-20 pb-20 pt-20">
        <h3 className="w-full text-xl rounded bg-secondery text-background py-2 px-4">پرسش های متداول</h3>
        <div className="mt-14 px-4 font-semibold">
          <Accordion data={faqData} />
        </div>
      </section>
    </div>
  );
};

export default Question;
